----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 128, 128]             432
       BatchNorm2d-2         [-1, 16, 128, 128]              32
             ReLU6-3         [-1, 16, 128, 128]               0
        conv_block-4         [-1, 16, 128, 128]               0
            Conv2d-5        [-1, 128, 128, 128]           2,048
       BatchNorm2d-6        [-1, 128, 128, 128]             256
             ReLU6-7        [-1, 128, 128, 128]               0
            Conv2d-8        [-1, 128, 128, 128]           1,152
       BatchNorm2d-9        [-1, 128, 128, 128]             256
            ReLU6-10        [-1, 128, 128, 128]               0
           Conv2d-11         [-1, 16, 128, 128]           2,048
      BatchNorm2d-12         [-1, 16, 128, 128]              32
  dwpw_conv_block-13         [-1, 16, 128, 128]               0
        MaxPool2d-14           [-1, 16, 64, 64]               0
           Conv2d-15          [-1, 128, 64, 64]           2,048
      BatchNorm2d-16          [-1, 128, 64, 64]             256
            ReLU6-17          [-1, 128, 64, 64]               0
           Conv2d-18          [-1, 128, 64, 64]           1,152
      BatchNorm2d-19          [-1, 128, 64, 64]             256
            ReLU6-20          [-1, 128, 64, 64]               0
           Conv2d-21           [-1, 16, 64, 64]           2,048
      BatchNorm2d-22           [-1, 16, 64, 64]              32
  dwpw_conv_block-23           [-1, 16, 64, 64]               0
           Conv2d-24          [-1, 128, 64, 64]           2,048
      BatchNorm2d-25          [-1, 128, 64, 64]             256
            ReLU6-26          [-1, 128, 64, 64]               0
           Conv2d-27          [-1, 128, 64, 64]           1,152
      BatchNorm2d-28          [-1, 128, 64, 64]             256
            ReLU6-29          [-1, 128, 64, 64]               0
           Conv2d-30           [-1, 16, 64, 64]           2,048
      BatchNorm2d-31           [-1, 16, 64, 64]              32
  dwpw_conv_block-32           [-1, 16, 64, 64]               0
        MaxPool2d-33           [-1, 16, 32, 32]               0
           Conv2d-34          [-1, 128, 32, 32]           2,048
      BatchNorm2d-35          [-1, 128, 32, 32]             256
            ReLU6-36          [-1, 128, 32, 32]               0
           Conv2d-37          [-1, 128, 32, 32]           1,152
      BatchNorm2d-38          [-1, 128, 32, 32]             256
            ReLU6-39          [-1, 128, 32, 32]               0
           Conv2d-40           [-1, 16, 32, 32]           2,048
      BatchNorm2d-41           [-1, 16, 32, 32]              32
  dwpw_conv_block-42           [-1, 16, 32, 32]               0
           Conv2d-43          [-1, 128, 32, 32]           2,048
      BatchNorm2d-44          [-1, 128, 32, 32]             256
            ReLU6-45          [-1, 128, 32, 32]               0
           Conv2d-46          [-1, 128, 32, 32]           1,152
      BatchNorm2d-47          [-1, 128, 32, 32]             256
            ReLU6-48          [-1, 128, 32, 32]               0
           Conv2d-49           [-1, 16, 32, 32]           2,048
      BatchNorm2d-50           [-1, 16, 32, 32]              32
  dwpw_conv_block-51           [-1, 16, 32, 32]               0
        MaxPool2d-52           [-1, 16, 16, 16]               0
           Conv2d-53          [-1, 128, 16, 16]           2,048
      BatchNorm2d-54          [-1, 128, 16, 16]             256
            ReLU6-55          [-1, 128, 16, 16]               0
           Conv2d-56          [-1, 128, 16, 16]           1,152
      BatchNorm2d-57          [-1, 128, 16, 16]             256
            ReLU6-58          [-1, 128, 16, 16]               0
           Conv2d-59           [-1, 16, 16, 16]           2,048
      BatchNorm2d-60           [-1, 16, 16, 16]              32
  dwpw_conv_block-61           [-1, 16, 16, 16]               0
           Conv2d-62          [-1, 128, 16, 16]           2,048
      BatchNorm2d-63          [-1, 128, 16, 16]             256
            ReLU6-64          [-1, 128, 16, 16]               0
           Conv2d-65          [-1, 128, 16, 16]           1,152
      BatchNorm2d-66          [-1, 128, 16, 16]             256
            ReLU6-67          [-1, 128, 16, 16]               0
           Conv2d-68           [-1, 16, 16, 16]           2,048
      BatchNorm2d-69           [-1, 16, 16, 16]              32
  dwpw_conv_block-70           [-1, 16, 16, 16]               0
        MaxPool2d-71             [-1, 16, 8, 8]               0
           Conv2d-72            [-1, 128, 8, 8]           2,048
      BatchNorm2d-73            [-1, 128, 8, 8]             256
            ReLU6-74            [-1, 128, 8, 8]               0
           Conv2d-75            [-1, 128, 8, 8]           1,152
      BatchNorm2d-76            [-1, 128, 8, 8]             256
            ReLU6-77            [-1, 128, 8, 8]               0
           Conv2d-78             [-1, 16, 8, 8]           2,048
      BatchNorm2d-79             [-1, 16, 8, 8]              32
  dwpw_conv_block-80             [-1, 16, 8, 8]               0
           Conv2d-81            [-1, 128, 8, 8]           2,048
      BatchNorm2d-82            [-1, 128, 8, 8]             256
            ReLU6-83            [-1, 128, 8, 8]               0
           Conv2d-84            [-1, 128, 8, 8]           1,152
      BatchNorm2d-85            [-1, 128, 8, 8]             256
            ReLU6-86            [-1, 128, 8, 8]               0
           Conv2d-87             [-1, 16, 8, 8]           2,048
      BatchNorm2d-88             [-1, 16, 8, 8]              32
  dwpw_conv_block-89             [-1, 16, 8, 8]               0
           Conv2d-90            [-1, 128, 8, 8]           2,048
      BatchNorm2d-91            [-1, 128, 8, 8]             256
            ReLU6-92            [-1, 128, 8, 8]               0
           Conv2d-93            [-1, 128, 8, 8]           1,152
      BatchNorm2d-94            [-1, 128, 8, 8]             256
            ReLU6-95            [-1, 128, 8, 8]               0
           Conv2d-96             [-1, 16, 8, 8]           2,048
      BatchNorm2d-97             [-1, 16, 8, 8]              32
  dwpw_conv_block-98             [-1, 16, 8, 8]               0
           Conv2d-99            [-1, 128, 8, 8]           2,048
     BatchNorm2d-100            [-1, 128, 8, 8]             256
           ReLU6-101            [-1, 128, 8, 8]               0
          Conv2d-102            [-1, 128, 8, 8]           1,152
     BatchNorm2d-103            [-1, 128, 8, 8]             256
           ReLU6-104            [-1, 128, 8, 8]               0
          Conv2d-105             [-1, 16, 8, 8]           2,048
     BatchNorm2d-106             [-1, 16, 8, 8]              32
 dwpw_conv_block-107             [-1, 16, 8, 8]               0
          Conv2d-108            [-1, 128, 8, 8]           2,048
     BatchNorm2d-109            [-1, 128, 8, 8]             256
           ReLU6-110            [-1, 128, 8, 8]               0
          Conv2d-111            [-1, 128, 8, 8]           1,152
     BatchNorm2d-112            [-1, 128, 8, 8]             256
           ReLU6-113            [-1, 128, 8, 8]               0
          Conv2d-114             [-1, 16, 8, 8]           2,048
     BatchNorm2d-115             [-1, 16, 8, 8]              32
 dwpw_conv_block-116             [-1, 16, 8, 8]               0
          Conv2d-117            [-1, 128, 8, 8]           2,048
     BatchNorm2d-118            [-1, 128, 8, 8]             256
           ReLU6-119            [-1, 128, 8, 8]               0
          Conv2d-120            [-1, 128, 8, 8]           1,152
     BatchNorm2d-121            [-1, 128, 8, 8]             256
           ReLU6-122            [-1, 128, 8, 8]               0
          Conv2d-123             [-1, 16, 8, 8]           2,048
     BatchNorm2d-124             [-1, 16, 8, 8]              32
 dwpw_conv_block-125             [-1, 16, 8, 8]               0
          Conv2d-126            [-1, 128, 8, 8]           2,048
     BatchNorm2d-127            [-1, 128, 8, 8]             256
           ReLU6-128            [-1, 128, 8, 8]               0
          Conv2d-129            [-1, 128, 8, 8]           1,152
     BatchNorm2d-130            [-1, 128, 8, 8]             256
           ReLU6-131            [-1, 128, 8, 8]               0
          Conv2d-132             [-1, 16, 8, 8]           2,048
     BatchNorm2d-133             [-1, 16, 8, 8]              32
 dwpw_conv_block-134             [-1, 16, 8, 8]               0
          Conv2d-135            [-1, 128, 8, 8]           2,048
     BatchNorm2d-136            [-1, 128, 8, 8]             256
           ReLU6-137            [-1, 128, 8, 8]               0
          Conv2d-138            [-1, 128, 8, 8]           1,152
     BatchNorm2d-139            [-1, 128, 8, 8]             256
           ReLU6-140            [-1, 128, 8, 8]               0
          Conv2d-141             [-1, 16, 8, 8]           2,048
     BatchNorm2d-142             [-1, 16, 8, 8]              32
 dwpw_conv_block-143             [-1, 16, 8, 8]               0
          Conv2d-144            [-1, 128, 8, 8]           2,048
     BatchNorm2d-145            [-1, 128, 8, 8]             256
           ReLU6-146            [-1, 128, 8, 8]               0
          Conv2d-147            [-1, 128, 8, 8]           1,152
     BatchNorm2d-148            [-1, 128, 8, 8]             256
           ReLU6-149            [-1, 128, 8, 8]               0
          Conv2d-150             [-1, 16, 8, 8]           2,048
     BatchNorm2d-151             [-1, 16, 8, 8]              32
 dwpw_conv_block-152             [-1, 16, 8, 8]               0
          Conv2d-153            [-1, 128, 8, 8]           2,048
     BatchNorm2d-154            [-1, 128, 8, 8]             256
           ReLU6-155            [-1, 128, 8, 8]               0
          Conv2d-156            [-1, 128, 8, 8]           1,152
     BatchNorm2d-157            [-1, 128, 8, 8]             256
           ReLU6-158            [-1, 128, 8, 8]               0
          Conv2d-159             [-1, 16, 8, 8]           2,048
     BatchNorm2d-160             [-1, 16, 8, 8]              32
 dwpw_conv_block-161             [-1, 16, 8, 8]               0
AdaptiveAvgPool2d-162             [-1, 16, 1, 1]               0
          Linear-163                   [-1, 11]             187
================================================================
